
public class Launcher {
    public static void main(String[] args) {
        Action act = new Action(10);
        act.addEmployee("Долбаебы", "Тимошенко", "Димон", "Анатольевич", 60215.10);
        act.addEmployee("Долбаебы", "Невский", "Александр", "Шварцнегерович", 5000000.25);
        act.addEmployee("Долбаебы", "Бомжатов", "Монгол", "Бухаревич", 20.99);
        act.addEmployee("Разработчики", "Романов", "Евгений", "Александрович", 420000.50);
        act.addEmployee("Разработчики", "Насибуллин", "Роман", "Ильсурович", 420000.99);
        act.addEmployee("Разработчики", "Писишников", "Константин", "Прокофьевич", 375000.11);
        act.addEmployee("Администраторы", "Админов", "Сергей", "Сервович", 312000.11);
        act.addEmployee("Администраторы", "Бозов", "Эскель", "Ораколович", 392000.20);
        act.addEmployee("Техподдержка", "Индусов", "Араб", "Тупорылыч", 33220.00);
        act.addEmployee("Техподдержка", "Социопатов", "Димониум", "Картбланшевич", 33220.00);
        act.editDepartment("Социопатов Димониум Картбланшевич", "Долбаебы");
        act.allDataEmp();
    }
}
